backend: tensorflow
class_name: Sequential
config:
- class_name: Embedding
  config:
    activity_regularizer: null
    batch_input_shape: !!python/tuple [null, 160]
    dtype: float32
    embeddings_constraint: null
    embeddings_initializer:
      class_name: RandomUniform
      config: {maxval: 0.05, minval: -0.05, seed: null}
    embeddings_regularizer: null
    input_dim: 6000
    input_length: 160
    mask_zero: false
    name: embedding_24
    output_dim: 100
    trainable: true
- class_name: Dropout
  config: {name: dropout_36, noise_shape: null, rate: 0.1, seed: null, trainable: true}
- class_name: Conv1D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    dilation_rate: !!python/tuple [1]
    filters: 100
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3]
    name: conv1d_23
    padding: valid
    strides: !!python/tuple [1]
    trainable: true
    use_bias: true
- class_name: GlobalMaxPooling1D
  config: {name: global_max_pooling1d_23, trainable: true}
- class_name: Dense
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_44
    trainable: true
    units: 100
    use_bias: true
- class_name: Dropout
  config: {name: dropout_37, noise_shape: null, rate: 0.1, seed: null, trainable: true}
- class_name: Activation
  config: {activation: relu, name: activation_44, trainable: true}
- class_name: Dense
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_45
    trainable: true
    units: 1
    use_bias: true
- class_name: Activation
  config: {activation: sigmoid, name: activation_45, trainable: true}
keras_version: 2.1.5
